In [1]:
import pandas
from pandas import DataFrame,Series

## Series more like list ; in general more faster than list

In [2]:
kk = Series([-1,2,3,4,5])
kk.dtype
print(f"kk: \n{kk}")

kk:
0   -1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
ss = Series([-1,2,'3',4,5])
ss.dtype
print(f"ss: \n{ss}")

ss:
0    -1
1     2
2     3
3     4
4     5
dtype: object

## To get elements from Series with random index

In [4]:
obj =Series([1,5,7,8,23])
I=[0,2,3]
obj[I]

0    1
2    7
3    8
dtype: int64

In [25]:
#i_pos = obj > 5
obj[obj>5]

2     7
3     8
4    23
dtype: int64

In [6]:
def divide(x, y):
    try:
        # Floor Division : Gives only Fractional Part as Answer
        result = x // y
        print("Yeah ! Your answer is :", result)
    except ZeroDivisionError:
        print("Sorry ! You are dividing by zero ")
 
# Look at parameters and note the working of Program
divide(3, 0)

Sorry ! You are dividing by zero

In [47]:
# obj[obj>5][0]  ## gives KeyError: 0

In [49]:
try:
    print(obj[obj>5][0])
except KeyError:
    print("Sorry ! Wrong index  ")

Sorry ! Wrong index

## Defining index for Series - More like dictionary

In [58]:
ss = Series([1,2,3,4,5],['a','b','c','d','e'])
ss

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [59]:
ss['a'] ## more like dictionary

1

## Constructing Series from dictionary

In [65]:
d = {'a':1,'b':2,'c':3}
ss = Series(d)
ss

a    1
b    2
c    3
dtype: int64

In [66]:
'a' in d

True

## In for key searching and isin for value searching

In [72]:
if 'a' in ss:
    print(ss['a'])

ss.isin([1])

1

a     True
b    False
c    False
dtype: bool

### apply method

In [76]:
x= Series([-1,2,3])
x.apply(abs)

0    1
1    2
2    3
dtype: int64

# Series naming

In [77]:
x.name = 'áse'

In [79]:
x

0   -1
1    2
2    3
Name: áse, dtype: int64

## Dataframe - where every column is series

In [83]:
details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
ss = DataFrame(details)
ss

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [90]:
ss['University']
ss.index
ss.columns
ss[['University','Age']]
ss.iloc[0]

Name          Ankit
Age              23
University      BHU
Name: 0, dtype: object

In [91]:
ss[1::2]

        Name  Age University
1  Aishwarya   21        JNU
3   Shivangi   21        BHU

In [92]:
ss.iloc[0,0]

'Ankit'

## Set index as name  ## Converting column to index

In [97]:
gg = ss.set_index('Name')
gg

           Age University
Name
Ankit       23        BHU
Aishwarya   21        JNU
Shaurya     22         DU
Shivangi    21        BHU

## loc access subset of rows

In [100]:
gg.loc[['Ankit','Shivangi']]
type(gg.loc[['Ankit','Shivangi']])  ## Returns dataframe

pandas.core.frame.DataFrame

In [101]:
gg.loc['Ankit']
type(gg.loc['Ankit']) ## returns Series

pandas.core.series.Series

In [104]:
gg.iloc[1,1]

'JNU'

In [8]:
cafes = DataFrame({'name': ['east pole', 'chrome yellow', 'brash', 'taproom', '3heart', 'spiller park pcm', 'refuge', 'toptime'],
                   'zip': [30324, 30312, 30318, 30317, 30306, 30308, 30303, 30318],
                   'poc': ['jared', 'kelly', 'matt', 'jonathan', 'nhan', 'dale', 'kitti', 'nolan']})
print("type:", type(cafes))
print(cafes)

type: <class 'pandas.core.frame.DataFrame'>
               name    zip       poc
0         east pole  30324     jared
1     chrome yellow  30312     kelly
2             brash  30318      matt
3           taproom  30317  jonathan
4            3heart  30306      nhan
5  spiller park pcm  30308      dale
6            refuge  30303     kitti
7           toptime  30318     nolan

In [9]:
cafes.set_index('name').loc[['east pole','chrome yellow']]

                 zip    poc
name
east pole      30324  jared
chrome yellow  30312  kelly

In [10]:
cafes2 = cafes.set_index('name')

In [11]:
cafes2.index
cafes2.columns

Index(['zip', 'poc'], dtype='object')

In [12]:
cafes2['Price']='$$'

In [13]:
cafes2['Rating']=4.0

In [14]:
cafes2

                    zip       poc Price  Rating
name
east pole         30324     jared    $$     4.0
chrome yellow     30312     kelly    $$     4.0
brash             30318      matt    $$     4.0
taproom           30317  jonathan    $$     4.0
3heart            30306      nhan    $$     4.0
spiller park pcm  30308      dale    $$     4.0
refuge            30303     kitti    $$     4.0
toptime           30318     nolan    $$     4.0

## Apply

In [15]:
cafes2['Price_int'] = cafes2['Price'].apply(lambda x: len(x))

In [17]:
def lee(x):
    return len(x)

In [20]:
cafes2['Price'].apply(lee)

name
east pole           2
chrome yellow       2
brash               2
taproom             2
3heart              2
spiller park pcm    2
refuge              2
toptime             2
Name: Price, dtype: int64

In [16]:
cafes2

                    zip       poc Price  Rating  Price_int
name
east pole         30324     jared    $$     4.0          2
chrome yellow     30312     kelly    $$     4.0          2
brash             30318      matt    $$     4.0          2
taproom           30317  jonathan    $$     4.0          2
3heart            30306      nhan    $$     4.0          2
spiller park pcm  30308      dale    $$     4.0          2
refuge            30303     kitti    $$     4.0          2
toptime           30318     nolan    $$     4.0          2

In [17]:
cafes2['value'] = cafes2['Rating'] / cafes2['Price_int']
cafes2

                    zip       poc Price  Rating  Price_int  value
name
east pole         30324     jared    $$     4.0          2    2.0
chrome yellow     30312     kelly    $$     4.0          2    2.0
brash             30318      matt    $$     4.0          2    2.0
taproom           30317  jonathan    $$     4.0          2    2.0
3heart            30306      nhan    $$     4.0          2    2.0
spiller park pcm  30308      dale    $$     4.0          2    2.0
refuge            30303     kitti    $$     4.0          2    2.0
toptime           30318     nolan    $$     4.0          2    2.0

In [24]:
## Try changing the price of zip codes with 30306 and 30308 zip codes to $$$ dollars

## The below method won't work as it slices 
# A value is trying to be set on a copy of a slice from a DataFrame.
# Try using .loc[row_indexer,col_indexer] = value instead

In [22]:
cafes2[cafes2['zip'].isin(['30306','30308'])]['Price']=cafes2[cafes2['zip'].isin(['30306','30308'])]['Price']+'$'

<ipython-input-22-fbdf15356e06>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cafes2[cafes2['zip'].isin(['30306','30308'])]['Price']=cafes2[cafes2['zip'].isin(['30306','30308'])]['Price']+'$'

In [23]:
cafes2

                    zip       poc Price  Rating  Price_int
name
east pole         30324     jared    $$     4.0          2
chrome yellow     30312     kelly    $$     4.0          2
brash             30318      matt    $$     4.0          2
taproom           30317  jonathan    $$     4.0          2
3heart            30306      nhan    $$     4.0          2
spiller park pcm  30308      dale    $$     4.0          2
refuge            30303     kitti    $$     4.0          2
toptime           30318     nolan    $$     4.0          2

In [31]:
cafes2.loc[cafes2['zip'].isin(['30306','30308']),'Price']=cafes2.loc[cafes2['zip'].isin(['30306','30308']),'Price']+'$'

In [32]:
cafes2

                    zip       poc Price  Rating  Price_int  value
name
east pole         30324     jared    $$     4.0          2    2.0
chrome yellow     30312     kelly    $$     4.0          2    2.0
brash             30318      matt    $$     4.0          2    2.0
taproom           30317  jonathan    $$     4.0          2    2.0
3heart            30306      nhan   $$$     4.0          2    2.0
spiller park pcm  30308      dale   $$$     4.0          2    2.0
refuge            30303     kitti    $$     4.0          2    2.0
toptime           30318     nolan    $$     4.0          2    2.0

## Apply with axis =0 will process each column  
## whereas axis =1 will process on each rows
## df.apply(fun, axis = 1) ## for each row 'x' call fun(x) where x is a series with index name of each row

In [36]:
cafes2.apply(lambda x:type(x),axis=0)

zip          <class 'pandas.core.series.Series'>
poc          <class 'pandas.core.series.Series'>
Price        <class 'pandas.core.series.Series'>
Rating       <class 'pandas.core.series.Series'>
Price_int    <class 'pandas.core.series.Series'>
value        <class 'pandas.core.series.Series'>
dtype: object

In [37]:
cafes2.apply(lambda x:type(x),axis=1)

name
east pole           <class 'pandas.core.series.Series'>
chrome yellow       <class 'pandas.core.series.Series'>
brash               <class 'pandas.core.series.Series'>
taproom             <class 'pandas.core.series.Series'>
3heart              <class 'pandas.core.series.Series'>
spiller park pcm    <class 'pandas.core.series.Series'>
refuge              <class 'pandas.core.series.Series'>
toptime             <class 'pandas.core.series.Series'>
dtype: object

In [41]:
cafes2.apply(lambda x:repr(x) if x.name =='east pole' else None,axis=1)

name
east pole           zip          30324\npoc          jared\nPrice ...
chrome yellow                                                    None
brash                                                            None
taproom                                                          None
3heart                                                           None
spiller park pcm                                                 None
refuge                                                           None
toptime                                                          None
dtype: object

In [42]:
cafes2.apply(lambda x:print(f"x==>>{repr(x)}") if x.name =='east pole' else None,axis=1)

x==>>zip          30324
poc          jared
Price           $$
Rating           4
Price_int        2
value            2
Name: east pole, dtype: object

name
east pole           None
chrome yellow       None
brash               None
taproom             None
3heart              None
spiller park pcm    None
refuge              None
toptime             None
dtype: object

In [43]:
cafes2.loc['east pole']

zip          30324
poc          jared
Price           $$
Rating           4
Price_int        2
value            2
Name: east pole, dtype: object

In [51]:
def revised_rating(row):
    print(type(row['Rating']))
    return row['Rating']/len(row['Price'])
    
cafes2['Rev_Rating']=cafes2.apply(revised_rating,axis=1)

<class 'float'>
<class 'float'>
<class 'float'>
<class 'float'>
<class 'float'>
<class 'float'>
<class 'float'>
<class 'float'>

In [52]:
cafes2

                    zip       poc Price  Rating  Price_int  value  Rev_Rating
name
east pole         30324     jared    $$     4.0          2    2.0    2.000000
chrome yellow     30312     kelly    $$     4.0          2    2.0    2.000000
brash             30318      matt    $$     4.0          2    2.0    2.000000
taproom           30317  jonathan    $$     4.0          2    2.0    2.000000
3heart            30306      nhan   $$$     4.0          2    2.0    1.333333
spiller park pcm  30308      dale   $$$     4.0          2    2.0    1.333333
refuge            30303     kitti    $$     4.0          2    2.0    2.000000
toptime           30318     nolan    $$     4.0          2    2.0    2.000000